apache/mynewt-core/hw/drivers/chg_ctrl/da1469x_charger/src/da1469x_charger_shell.c
/*
 * Licensed to the Apache Software Foundation (ASF) under one
 * or more contributor license agreements.  See the NOTICE file
 * distributed with this work for additional information
 * regarding copyright ownership.  The ASF licenses this file
 * to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance
 * with the License.  You may obtain a copy of the License at
 *
 *  http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing,
 * software distributed under the License is distributed on an
 * "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
 * KIND, either express or implied.  See the License for the
 * specific language governing permissions and limitations
 * under the License.
 */

#include <os/mynewt.h>

#if MYNEWT_VAL(DA1469X_CHARGER_CLI)

#include <console/console.h>
#include <shell/shell.h>
#include <da1469x_charger/da1469x_charger.h>
#include <parse/parse.h>
#include <stdio.h>
#include <DA1469xAB.h>
#if MYNEWT_VAL(SDADC_BATTERY)
#include <sdadc_da1469x/sdadc_da1469x.h>
#endif
#if MYNEWT_VAL(GPADC_BATTERY)
#include <gpadc_da1469x/gpadc_da1469x.h>
#endif

/*
 * Struct for field name description.
 * Used for argument validation and field decoding
 */
struct reg_field {
    /* Name of field */
    const char *fld_name;
    /* Position of field in register (LSB position) */
    uint8_t fld_pos;
    bool fld_show_bits;
    /* Mask of bit field to set or extract */
    uint32_t fld_mask;
    /* Function that will convert register value to descriptive string */
    const char *(*fld_decode_value)(const struct reg_field *field,
            uint32_t reg_val, char *buf);
    /* Argument that could be used by above function */
    const void *fld_arg;
};

/**
* Register structure
*/
struct reg {
    /* Address of the register */
    volatile uint32_t *addr;
    /* Name of the register */
    const char *name;
    /* Array of bit fields */
    const struct reg_field *fields;
};

static const char *const charger_state[] = {
    "POWER_UP",
    "INIT",
    "DISABLED",
    "PRE_CHARGE",
    "CC_CHARGE",
    "CV_CHARGE",
    "END_OF_CHARGE",
    "TDIE_PROT",
    "TBAT_PROT",
    "BYPASSED",
    "ERROR",
    NULL,
};

static const char *const tbat_status[] = {
    "",
    "COLD",
    "COOL",
    "",
    "NORMAL",
    "",
    "",
    "",
    "WARM",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "HOT",
    NULL,
};

#if MYNEWT_VAL(DA1469X_CHARGER_CLI_DECODE)

bool da1469x_charger_cli_decode_fields;

/* Change ix value to string from table.
 * Table is NULL terminated. Access outside of range will result in
 * returning ??? string
 */
static const char *
val_decode_from_table(const char *const tab[], int ix)
{
    while (ix && tab[ix]) {
        ix--;
        tab++;
    }
    if (tab[0]) {
        return tab[0];
    } else {
        return "???";
    }
}

/* Decode bit field using table with mapped values */
static const char *
reg_decode_from_table(const struct reg_field *field,
                      uint32_t reg_val, char *buf)
{
    uint32_t val = (reg_val & field->fld_mask) >> field->fld_pos;
    const char *const *table = field->fld_arg;

    return strcpy(buf, val_decode_from_table(table, val));
}

#define FIELD_NUM(reg, field) { .fld_name = #field, .fld_pos = CHARGER_CHARGER_##reg##_REG_##field##_Pos, \
    .fld_show_bits = 0, .fld_mask = CHARGER_CHARGER_##reg##_REG_##field##_Msk }
#define FIELD_TAB(reg, field, tab) { .fld_name = #field, .fld_pos = CHARGER_CHARGER_##reg##_REG_##field##_Pos, \
    .fld_show_bits = 1, .fld_mask = CHARGER_CHARGER_##reg##_REG_##field##_Msk, .fld_decode_value = reg_decode_from_table, .fld_arg = tab }
#define FIELD_FUN(reg, field, fun, arg) { .fld_name = #field, .fld_pos = CHARGER_CHARGER_##reg##_REG_##field##_Pos, \
    .fld_show_bits = 1, .fld_mask = CHARGER_CHARGER_##reg##_REG_##field##_Msk, .fld_decode_value = fun, .fld_arg = arg }

/* Fields for CTRL register */
static const struct reg_field CTRL_fields[] = {
    FIELD_NUM(CTRL, EOC_INTERVAL_CHECK_TIMER),
    FIELD_NUM(CTRL, EOC_INTERVAL_CHECK_THRES),
    FIELD_NUM(CTRL, REPLENISH_MODE),
    FIELD_NUM(CTRL, PRE_CHARGE_MODE),
    FIELD_NUM(CTRL, CHARGE_LOOP_HOLD),
    FIELD_NUM(CTRL, JEITA_SUPPORT_DISABLED),
    FIELD_NUM(CTRL, TBAT_MONITOR_MODE),
    FIELD_NUM(CTRL, CHARGE_TIMERS_HALT_ENABLE),
    FIELD_NUM(CTRL, NTC_LOW_DISABLE),
    FIELD_NUM(CTRL, TBAT_PROT_ENABLE),
    FIELD_NUM(CTRL, TDIE_ERROR_RESUME),
    FIELD_NUM(CTRL, TDIE_PROT_ENABLE),
    FIELD_NUM(CTRL, CHARGER_RESUME),
    FIELD_NUM(CTRL, CHARGER_BYPASS),
    FIELD_NUM(CTRL, CHARGE_START),
    FIELD_NUM(CTRL, CHARGER_ENABLE),
    { NULL }
};

static const char *const charger_jeita_state[] = {
    "CHECK_IDLE",
    "CHECK_THOT",
    "CHECK_TCOLD",
    "CHECK_TWORM",
    "CHECK_TCOOL",
    "CHECK_TNORMAL",
    "UPDATE_TBAT",
    NULL,
};

/* Fields for STATUS register */
static const struct reg_field STATUS_fields[] = {
    FIELD_NUM(STATUS, OVP_EVENTS_DEBOUNCE_CNT),
    FIELD_NUM(STATUS, EOC_EVENTS_DEBOUNCE_CNT),
    FIELD_NUM(STATUS, TDIE_ERROR_DEBOUNCE_CNT),
    FIELD_TAB(STATUS, CHARGER_JEITA_STATE, charger_jeita_state),
    FIELD_TAB(STATUS, CHARGER_STATE, charger_state),
    FIELD_TAB(STATUS, TBAT_STATUS, tbat_status),
    FIELD_NUM(STATUS, MAIN_TBAT_COMP_OUT),
    FIELD_NUM(STATUS, TBAT_HOT_COMP_OUT),
    FIELD_NUM(STATUS, TDIE_COMP_OUT),
    FIELD_NUM(STATUS, VBAT_OVP_COMP_OUT),
    FIELD_NUM(STATUS, MAIN_VBAT_COMP_OUT),
    FIELD_NUM(STATUS, END_OF_CHARGE),
    FIELD_NUM(STATUS, CHARGER_CV_MODE),
    FIELD_NUM(STATUS, CHARGER_CC_MODE),
    FIELD_NUM(STATUS, CHARGER_IS_POWERED_UP),
    { NULL }
};

static const char *
voltage_decode(const struct reg_field *field, uint32_t reg_val, char *buf)
{
    uint32_t val = (reg_val & field->fld_mask) >> field->fld_pos;

    if (val < 20) {
        val = 280 + 5 * val;
    } else if (val < 60) {
        val = 380 + 2 * (val - 20);
    } else {
        val = 460 + 10 * (val - 60);
    }
    sprintf(buf, "%d.%02d V", (int)val / 100, (int)val % 100);
    return buf;
}

/* Fields for VOLTAGE_PARAM register */
static const struct reg_field VOLTAGE_PARAM_fields[] = {
    FIELD_FUN(VOLTAGE_PARAM, V_OVP, voltage_decode, NULL),
    FIELD_FUN(VOLTAGE_PARAM, V_REPLENISH, voltage_decode, NULL),
    FIELD_FUN(VOLTAGE_PARAM, V_PRECHARGE, voltage_decode, NULL),
    FIELD_FUN(VOLTAGE_PARAM, V_CHARGE, voltage_decode, NULL),
    { NULL }
};

static const uint16_t i_eoc[][8] = {
    { 40, 55, 70, 85, 100, 120, 140, 160},
    { 88, 121, 154, 187, 220, 264, 308, 352},
};

static const char *
current_eoc_decode(const struct reg_field *field, uint32_t reg_val, char *buf)
{
    int val;
    size_t ix = (reg_val & field->fld_mask) >> field->fld_pos;
    size_t mul = 0;

    if (reg_val & CHARGER_CHARGER_CURRENT_PARAM_REG_I_EOC_DOUBLE_RANGE_Msk) {
        mul = 1;
    }
    val = i_eoc[mul][ix];

    sprintf(buf, "%d.%d %%", val / 10, val % 10);

    return buf;
}

static const char *
current_precharge(const struct reg_field *field, uint32_t reg_val, char *buf)
{
    int val = (int)((reg_val & field->fld_mask) >> field->fld_pos);

    if (val < 15) {
        val = 5 + 5 * val;
    } else if (val < 32) {
        val = 80 + 10 * (val - 15);
    } else if (val < 47) {
        val = 240 + 20 * (val - 31);
    } else {
        val = 560;
    }
    sprintf(buf, "%d.%d mA", val / 10, val % 10);

    return buf;
}

static const char *
current_charge(const struct reg_field *field, uint32_t reg_val, char *buf)
{
    int val = (int)((reg_val & field->fld_mask) >> field->fld_pos);

    if (val < 15) {
        val = 5 + 5 * val;
    } else if (val < 32) {
        val = 80 + 10 * (val - 15);
    } else if (val < 47) {
        val = 240 + 20 * (val - 31);
    } else {
        val = 560;
    }
    sprintf(buf, "%d mA", val);

    return buf;
}

