apache/mynewt-core/hw/drivers/chg_ctrl/da1469x_charger/src/da1469x_charger_shell.c
/* Fields for CURRENT_PARAM register */
static const struct reg_field CURRENT_PARAM_fields[] = {
    FIELD_NUM(CURRENT_PARAM, I_EOC_DOUBLE_RANGE),
    FIELD_FUN(CURRENT_PARAM, I_END_OF_CHARGE, current_eoc_decode, NULL),
    FIELD_FUN(CURRENT_PARAM, I_PRECHARGE, current_precharge, NULL),
    FIELD_FUN(CURRENT_PARAM, I_CHARGE, current_charge, NULL),
    { NULL }
};

static const char *const tdie_max[] = {
    "0 C",
    "50 C",
    "80 C",
    "90 C",
    "100 C",
    "110 C",
    "120 C",
    "130 C",
    NULL,
};

static const char *
tbat_temp(const struct reg_field *field, uint32_t reg_val, char *buf)
{
    int val = (int)((reg_val & field->fld_mask) >> field->fld_pos);

    val -= 10;
    sprintf(buf, "%d C", val);
    return buf;
}

/* Fields for TEMPSET_PARAM register */
static const struct reg_field TEMPSET_PARAM_fields[] = {
    FIELD_TAB(TEMPSET_PARAM, TDIE_MAX, tdie_max),
    FIELD_FUN(TEMPSET_PARAM, TBAT_HOT, tbat_temp, NULL),
    FIELD_FUN(TEMPSET_PARAM, TBAT_WARM, tbat_temp, NULL),
    FIELD_FUN(TEMPSET_PARAM, TBAT_COOL, tbat_temp, NULL),
    FIELD_FUN(TEMPSET_PARAM, TBAT_COLD, tbat_temp, NULL),
    { NULL }
};

/* Fields for PRE_CHARGE_TIMER register */
static const struct reg_field PRE_CHARGE_TIMER_fields[] = {
    FIELD_NUM(PRE_CHARGE_TIMER, PRE_CHARGE_TIMER),
    FIELD_NUM(PRE_CHARGE_TIMER, MAX_PRE_CHARGE_TIME),
    { NULL }
};

/* Fields for CC_CHARGE_TIMER register */
static const struct reg_field CC_CHARGE_TIMER_fields[] = {
    FIELD_NUM(CC_CHARGE_TIMER, CC_CHARGE_TIMER),
    FIELD_NUM(CC_CHARGE_TIMER, MAX_CC_CHARGE_TIME),
    { NULL }
};

/* Fields for CV_CHARGE_TIMER register */
static const struct reg_field CV_CHARGE_TIMER_fields[] = {
    FIELD_NUM(CV_CHARGE_TIMER, CV_CHARGE_TIMER),
    FIELD_NUM(CV_CHARGE_TIMER, MAX_CV_CHARGE_TIME),
    { NULL }
};

/* Fields for TOTAL_CHARGE_TIMER register */
static const struct reg_field TOTAL_CHARGE_TIMER_fields[] = {
    FIELD_NUM(TOTAL_CHARGE_TIMER, TOTAL_CHARGE_TIMER),
    FIELD_NUM(TOTAL_CHARGE_TIMER, MAX_TOTAL_CHARGE_TIME),
    { NULL }
};

/* Fields for JEITA_V_CHARGE register */
static const struct reg_field JEITA_V_CHARGE_fields[] = {
    FIELD_FUN(JEITA_V_CHARGE, V_CHARGE_TWARM, voltage_decode, NULL),
    FIELD_FUN(JEITA_V_CHARGE, V_CHARGE_TCOOL, voltage_decode, NULL),
    { NULL }
};

/* Fields for JEITA_V_PRECHARGE register */
static const struct reg_field JEITA_V_PRECHARGE_fields[] = {
    FIELD_FUN(JEITA_V_PRECHARGE, V_PRECHARGE_TWARM, voltage_decode, NULL),
    FIELD_FUN(JEITA_V_PRECHARGE, V_PRECHARGE_TCOOL, voltage_decode, NULL),
    { NULL }
};

/* Fields for JEITA_V_REPLENISH register */
static const struct reg_field JEITA_V_REPLENISH_fields[] = {
    FIELD_FUN(JEITA_V_REPLENISH, V_REPLENISH_TWARM, voltage_decode, NULL),
    FIELD_FUN(JEITA_V_REPLENISH, V_REPLENISH_TCOOL, voltage_decode, NULL),
    { NULL }
};

/* Fields for JEITA_V_OVP register */
static const struct reg_field JEITA_V_OVP_fields[] = {
    FIELD_FUN(JEITA_V_OVP, V_OVP_TWARM, voltage_decode, NULL),
    FIELD_FUN(JEITA_V_OVP, V_OVP_TCOOL, voltage_decode, NULL),
    { NULL }
};

/* Fields for JEITA_CURRENT register */
static const struct reg_field JEITA_CURRENT_fields[] = {
    FIELD_FUN(JEITA_CURRENT, I_PRECHARGE_TWARM, current_precharge, NULL),
    FIELD_FUN(JEITA_CURRENT, I_PRECHARGE_TCOOL, current_precharge, NULL),
    FIELD_FUN(JEITA_CURRENT, I_CHARGE_TWARM, current_charge, NULL),
    FIELD_FUN(JEITA_CURRENT, I_CHARGE_TCOOL, current_charge, NULL),
    { NULL }
};

/* Fields for VBAT_COMP_TIMER register */
static const struct reg_field VBAT_COMP_TIMER_fields[] = {
    FIELD_NUM(VBAT_COMP_TIMER, VBAT_COMP_TIMER),
    FIELD_NUM(VBAT_COMP_TIMER, VBAT_COMP_SETTLING),
    { NULL }
};

/* Fields for VOVP_COMP_TIMER register */
static const struct reg_field VOVP_COMP_TIMER_fields[] = {
    FIELD_NUM(VOVP_COMP_TIMER, OVP_INTERVAL_CHECK_TIMER),
    FIELD_NUM(VOVP_COMP_TIMER, VBAT_OVP_COMP_TIMER),
    FIELD_NUM(VOVP_COMP_TIMER, OVP_INTERVAL_CHECK_THRES),
    FIELD_NUM(VOVP_COMP_TIMER, VBAT_OVP_COMP_SETTLING),
    { NULL }
};

/* Fields for TDIE_COMP_TIMER register */
static const struct reg_field TDIE_COMP_TIMER_fields[] = {
    FIELD_NUM(TDIE_COMP_TIMER, TDIE_COMP_TIMER),
    FIELD_NUM(TDIE_COMP_TIMER, TDIE_COMP_SETTLING),
    { NULL }
};

/* Fields for TBAT_MON_TIMER register */
static const struct reg_field TBAT_MON_TIMER_fields[] = {
    FIELD_NUM(TBAT_MON_TIMER, TBAT_MON_TIMER),
    FIELD_NUM(TBAT_MON_TIMER, TBAT_MON_INTERVAL),
    { NULL }
};

/* Fields for TBAT_COMP_TIMER register */
static const struct reg_field TBAT_COMP_TIMER_fields[] = {
    FIELD_NUM(TBAT_COMP_TIMER, TBAT_COMP_TIMER),
    FIELD_NUM(TBAT_COMP_TIMER, TBAT_COMP_SETTLING),
    { NULL }
};

/* Fields for THOT_COMP_TIMER register */
static const struct reg_field THOT_COMP_TIMER_fields[] = {
    FIELD_NUM(THOT_COMP_TIMER, THOT_COMP_TIMER),
    FIELD_NUM(THOT_COMP_TIMER, THOT_COMP_SETTLING),
    { NULL }
};

/* Fields for PWR_UP_TIMER register */
static const struct reg_field PWR_UP_TIMER_fields[] = {
    FIELD_NUM(PWR_UP_TIMER, CHARGER_PWR_UP_TIMER),
    FIELD_NUM(PWR_UP_TIMER, CHARGER_PWR_UP_SETTLING),
    { NULL }
};

/* Fields for STATE_IRQ_MASK register */
static const struct reg_field STATE_IRQ_MASK_fields[] = {
    FIELD_NUM(STATE_IRQ_MASK, CV_TO_PRECHARGE_IRQ_EN),
    FIELD_NUM(STATE_IRQ_MASK, CC_TO_PRECHARGE_IRQ_EN),
    FIELD_NUM(STATE_IRQ_MASK, CV_TO_CC_IRQ_EN),
    FIELD_NUM(STATE_IRQ_MASK, TBAT_STATUS_UPDATE_IRQ_EN),
    FIELD_NUM(STATE_IRQ_MASK, TBAT_PROT_TO_PRECHARGE_IRQ_EN),
    FIELD_NUM(STATE_IRQ_MASK, TDIE_PROT_TO_PRECHARGE_IRQ_EN),
    FIELD_NUM(STATE_IRQ_MASK, EOC_TO_PRECHARGE_IRQ_EN),
    FIELD_NUM(STATE_IRQ_MASK, CV_TO_EOC_IRQ_EN),
    FIELD_NUM(STATE_IRQ_MASK, CC_TO_EOC_IRQ_EN),
    FIELD_NUM(STATE_IRQ_MASK, CC_TO_CV_IRQ_EN),
    FIELD_NUM(STATE_IRQ_MASK, PRECHARGE_TO_CC_IRQ_EN),
    FIELD_NUM(STATE_IRQ_MASK, DISABLED_TO_PRECHARGE_IRQ_EN),
    { NULL }
};

/* Fields for ERROR_IRQ_MASK register */
static const struct reg_field ERROR_IRQ_MASK_fields[] = {
    FIELD_NUM(ERROR_IRQ_MASK, TBAT_ERROR_IRQ_EN),
    FIELD_NUM(ERROR_IRQ_MASK, TDIE_ERROR_IRQ_EN),
    FIELD_NUM(ERROR_IRQ_MASK, VBAT_OVP_ERROR_IRQ_EN),
    FIELD_NUM(ERROR_IRQ_MASK, TOTAL_CHARGE_TIMEOUT_IRQ_EN),
    FIELD_NUM(ERROR_IRQ_MASK, CV_CHARGE_TIMEOUT_IRQ_EN),
    FIELD_NUM(ERROR_IRQ_MASK, CC_CHARGE_TIMEOUT_IRQ_EN),
    FIELD_NUM(ERROR_IRQ_MASK, PRECHARGE_TIMEOUT_IRQ_EN),
    { NULL }
};

/* Fields for STATE_IRQ_STATUS register */
static const struct reg_field STATE_IRQ_STATUS_fields[] = {
    FIELD_NUM(STATE_IRQ_STATUS, CV_TO_PRECHARGE_IRQ),
    FIELD_NUM(STATE_IRQ_STATUS, CC_TO_PRECHARGE_IRQ),
    FIELD_NUM(STATE_IRQ_STATUS, CV_TO_CC_IRQ),
    FIELD_NUM(STATE_IRQ_STATUS, TBAT_STATUS_UPDATE_IRQ),
    FIELD_NUM(STATE_IRQ_STATUS, TBAT_PROT_TO_PRECHARGE_IRQ),
    FIELD_NUM(STATE_IRQ_STATUS, TDIE_PROT_TO_PRECHARGE_IRQ),
    FIELD_NUM(STATE_IRQ_STATUS, EOC_TO_PRECHARGE_IRQ),
    FIELD_NUM(STATE_IRQ_STATUS, CV_TO_EOC_IRQ),
    FIELD_NUM(STATE_IRQ_STATUS, CC_TO_EOC_IRQ),
    FIELD_NUM(STATE_IRQ_STATUS, CC_TO_CV_IRQ),
    FIELD_NUM(STATE_IRQ_STATUS, PRECHARGE_TO_CC_IRQ),
    FIELD_NUM(STATE_IRQ_STATUS, DISABLED_TO_PRECHARGE_IRQ),
    { NULL }
};

/* Fields for ERROR_IRQ_STATUS register */
static const struct reg_field ERROR_IRQ_STATUS_fields[] = {
    FIELD_NUM(ERROR_IRQ_STATUS, TBAT_ERROR_IRQ),
    FIELD_NUM(ERROR_IRQ_STATUS, TDIE_ERROR_IRQ),
    FIELD_NUM(ERROR_IRQ_STATUS, VBAT_OVP_ERROR_IRQ),
    FIELD_NUM(ERROR_IRQ_STATUS, TOTAL_CHARGE_TIMEOUT_IRQ),
    FIELD_NUM(ERROR_IRQ_STATUS, CV_CHARGE_TIMEOUT_IRQ),
    FIELD_NUM(ERROR_IRQ_STATUS, CC_CHARGE_TIMEOUT_IRQ),
    FIELD_NUM(ERROR_IRQ_STATUS, PRECHARGE_TIMEOUT_IRQ),
    { NULL }
};

