apache/mynewt-core/hw/drivers/chg_ctrl/da1469x_charger/src/da1469x_charger_shell.c
/* Fields for STATE_IRQ_CLR register */
static const struct reg_field STATE_IRQ_CLR_fields[] = {
    FIELD_NUM(STATE_IRQ_CLR, CV_TO_PRECHARGE_IRQ_CLR),
    FIELD_NUM(STATE_IRQ_CLR, CC_TO_PRECHARGE_IRQ_CLR),
    FIELD_NUM(STATE_IRQ_CLR, CV_TO_CC_IRQ_CLR),
    FIELD_NUM(STATE_IRQ_CLR, TBAT_STATUS_UPDATE_IRQ_CLR),
    FIELD_NUM(STATE_IRQ_CLR, TBAT_PROT_TO_PRECHARGE_IRQ_CLR),
    FIELD_NUM(STATE_IRQ_CLR, TDIE_PROT_TO_PRECHARGE_IRQ_CLR),
    FIELD_NUM(STATE_IRQ_CLR, EOC_TO_PRECHARGE_IRQ_CLR),
    FIELD_NUM(STATE_IRQ_CLR, CV_TO_EOC_IRQ_CLR),
    FIELD_NUM(STATE_IRQ_CLR, CC_TO_EOC_IRQ_CLR),
    FIELD_NUM(STATE_IRQ_CLR, CC_TO_CV_IRQ_CLR),
    FIELD_NUM(STATE_IRQ_CLR, PRECHARGE_TO_CC_IRQ_CLR),
    FIELD_NUM(STATE_IRQ_CLR, DISABLED_TO_PRECHARGE_IRQ_CLR),
    { NULL }
};

/* Fields for ERROR_IRQ_CLR register */
static const struct reg_field ERROR_IRQ_CLR_fields[] = {
    FIELD_NUM(ERROR_IRQ_CLR, TBAT_ERROR_IRQ_CLR),
    FIELD_NUM(ERROR_IRQ_CLR, TDIE_ERROR_IRQ_CLR),
    FIELD_NUM(ERROR_IRQ_CLR, VBAT_OVP_ERROR_IRQ_CLR),
    FIELD_NUM(ERROR_IRQ_CLR, TOTAL_CHARGE_TIMEOUT_IRQ_CLR),
    FIELD_NUM(ERROR_IRQ_CLR, CV_CHARGE_TIMEOUT_IRQ_CLR),
    FIELD_NUM(ERROR_IRQ_CLR, CC_CHARGE_TIMEOUT_IRQ_CLR),
    FIELD_NUM(ERROR_IRQ_CLR, PRECHARGE_TIMEOUT_IRQ_CLR),
    { NULL }
};

#define REG(reg_name) { .addr = &CHARGER->CHARGER_##reg_name##_REG, .name = "CHARGER_"#reg_name"_REG", .fields = reg_name##_fields }

#else
#define da1469x_charger_cli_decode_fields false

#define REG(reg_name) { .addr = &CHARGER->CHARGER_##reg_name##_REG, .name = "CHARGER_"#reg_name"_REG", .fields = NULL }
#endif

#define REG_NAME(short_name) "CHARGER_"#short_name"_REG"

static const struct reg charger_regs[] = {
    REG(CTRL),
    REG(STATUS),
    REG(VOLTAGE_PARAM),
    REG(CURRENT_PARAM),
    REG(TEMPSET_PARAM),
    REG(PRE_CHARGE_TIMER),
    REG(CC_CHARGE_TIMER),
    REG(CV_CHARGE_TIMER),
    REG(TOTAL_CHARGE_TIMER),
    REG(JEITA_V_CHARGE),
    REG(JEITA_V_PRECHARGE),
    REG(JEITA_V_REPLENISH),
    REG(JEITA_V_OVP),
    REG(JEITA_CURRENT),
    REG(VBAT_COMP_TIMER),
    REG(VOVP_COMP_TIMER),
    REG(TDIE_COMP_TIMER),
    REG(TBAT_MON_TIMER),
    REG(TBAT_COMP_TIMER),
    REG(THOT_COMP_TIMER),
    REG(PWR_UP_TIMER),
    REG(STATE_IRQ_MASK),
    REG(ERROR_IRQ_MASK),
    REG(STATE_IRQ_STATUS),
    REG(ERROR_IRQ_STATUS),
    REG(STATE_IRQ_CLR),
    REG(ERROR_IRQ_CLR),
};
#define NUM_CHARGER_REGS ARRAY_SIZE(charger_regs)

static const struct shell_cmd da1469x_charger_shell_cmd_struct;

static int
da1469x_charger_help(void)
{
    console_printf("%s cmd\n", da1469x_charger_shell_cmd_struct.sc_cmd);
    console_printf("cmd:\n");
    console_printf("\thelp\n");
#if MYNEWT_VAL(DA1469X_CHARGER_CLI_DECODE)
    console_printf("\tdump [decode]\n");
#else
    console_printf("\tdump\n");
#endif
    console_printf("\tread <reg_name>\n");
    console_printf("\twrite <reg_anme> <value>\n");
    console_printf("\tdisable\n");
    console_printf("\tenable\n");
    console_printf("\tstatus\n");
    console_printf("\tseti <charge_i> [<precharge_i> [<eoc_percent>]]\n");
    console_printf("\tsetv <charge_v> [<precharge_v> [<replenish_v> [<ovp_v>]]]\n");
    console_printf("\tclrirq\n");
#if MYNEWT_VAL(DA1469X_CHARGER_USE_CHARGE_CONTROL)
    console_printf("\tlisten start | stop\n");
#endif
    return 0;
}

static int
da1469x_charger_shell_err_too_many_args(const char *cmd_name)
{
    console_printf("Error: too many arguments for command \"%s\"\n",
                   cmd_name);

    return SYS_EINVAL;
}

static int
da1469x_charger_shell_err_unknown_arg(const char *cmd_name)
{
    console_printf("Error: unknown argument \"%s\"\n",
                   cmd_name);

    return SYS_EINVAL;
}

#if MYNEWT_VAL(DA1469X_CHARGER_CLI_DECODE)

static const char *
field_bin_value(const struct reg_field *field, uint32_t val, char *buf)
{
    uint32_t mask = field->fld_mask >> field->fld_pos;
    int bits = 0;
    val = (val & field->fld_mask) >> field->fld_pos;

    for (bits = 0; mask; bits++) {
        mask >>= 1;
    }
    mask = field->fld_mask >> field->fld_pos;
    buf[bits] = '\0';
    while (mask) {
        buf[--bits] = (char)('0' + (val & 1));
        mask >>= 1;
        val >>= 1;
    }

    return buf;
}

static int
field_int_value(const struct reg_field *field, uint32_t val)
{
    return (int)((val & field->fld_mask) >> field->fld_pos);
}

static int
da1469x_charger_shell_cmd_decode(int argc, char **argv)
{
    long long val;
    int status;

    if (argc == 2) {
        val = parse_ll_bounds(argv[1], 0, 1, &status);
        if (status == 0) {
            da1469x_charger_cli_decode_fields = val != 0;
        }
    }
    console_printf("decode %d\n", (int)da1469x_charger_cli_decode_fields);

    return 0;
}

#endif /* MYNEWT_VAL(DA1469X_CHARGER_CLI_DECODE) */

static void
da1469x_charger_dump_register(const struct reg *reg, uint32_t val, bool decode)
{
#if MYNEWT_VAL(DA1469X_CHARGER_CLI_DECODE)
    const struct reg_field *field;
    char binary[33];
    char buf[50];
#endif
    console_printf("%-30s = 0x%08x \n", reg->name, (int)val);
#if MYNEWT_VAL(DA1469X_CHARGER_CLI_DECODE)
    if (decode && reg->fields) {
        for (field = reg->fields; field->fld_name; ++field) {
            if (field->fld_decode_value) {
                field->fld_decode_value(field, val, buf);
                if (field->fld_show_bits) {
                    console_printf("%32s = %s %s\n", field->fld_name,
                                   field_bin_value(field, val, binary), buf);
                } else {
                    console_printf("%32s = %s\n", field->fld_name, buf);
                }
            } else {
                if (field->fld_show_bits) {
                    console_printf("%32s = %s\n", field->fld_name,
                                   field_bin_value(field, val, binary));
                } else {
                    console_printf("%32s = %d\n", field->fld_name,
                                   field_int_value(field, val));
                }
            }
        }
    }
#endif
}

static int
da1469x_charger_shell_cmd_dump(int argc, char **argv)
{
    int i;
    uint32_t val;
    const struct reg *reg;
    bool decode = da1469x_charger_cli_decode_fields;

