apache/mynewt-core/hw/drivers/chg_ctrl/da1469x_charger/src/da1469x_charger_shell.c
#if MYNEWT_VAL(DA1469X_CHARGER_CLI_DECODE)
    if (argc > 2) {
        return da1469x_charger_shell_err_too_many_args(argv[1]);
    } else if (argc == 2) {
        if (strcmp(argv[1], "decode") == 0) {
            decode = true;
        } else if (strcmp(argv[1], "nodecode") == 0) {
            decode = false;
        } else {
            return da1469x_charger_shell_err_unknown_arg(argv[1]);
        }
    }
#else
    if (argc > 2) {
        return da1469x_charger_shell_err_too_many_args(argv[1]);
        return 0;
    }
#endif

    console_printf("========== Charger Regs ==========\n");
    console_printf("==================================\n\n");
    for (i = 0; i < NUM_CHARGER_REGS; ++i) {
        reg = &charger_regs[i];
        val = *reg->addr;
        da1469x_charger_dump_register(reg, val, decode);
    }

    return 0;
}

static int
da1469x_charger_shell_cmd_enable(int argc, char **argv)
{
    struct da1469x_charger_dev *dev =
        (struct da1469x_charger_dev *)os_dev_open("charger", 0, NULL);
    (void)argc;
    (void)argv;

    if (dev) {
        da1469x_charger_charge_enable(dev);
        os_dev_close(&dev->dev);
    }
    return 0;
}

static int
da1469x_charger_shell_cmd_disable(int argc, char **argv)
{
    struct da1469x_charger_dev *dev =
        (struct da1469x_charger_dev *)os_dev_open("charger", 0, NULL);
    (void)argc;
    (void)argv;

    if (dev) {
        da1469x_charger_charge_disable(dev);
        os_dev_close(&dev->dev);
    }
    return 0;
}

static int
da1469x_charger_shell_cmd_status(int argc, char **argv)
{
#if MYNEWT_VAL(SDADC_BATTERY) || MYNEWT_VAL(GPADC_BATTERY)
    struct adc_dev *adc;
    int bat_val;
#endif
    uint32_t val = CHARGER->CHARGER_STATUS_REG;
    uint32_t state = (val & CHARGER_CHARGER_STATUS_REG_CHARGER_STATE_Msk) >>
                      CHARGER_CHARGER_STATUS_REG_CHARGER_STATE_Pos;
    uint32_t bat_state = (val & CHARGER_CHARGER_STATUS_REG_TBAT_STATUS_Msk) >>
                          CHARGER_CHARGER_STATUS_REG_TBAT_STATUS_Pos;
    bool vbus_ok = (CRG_TOP->ANA_STATUS_REG & CRG_TOP_ANA_STATUS_REG_VBUS_AVAILABLE_Msk) != 0;
    const uint32_t mask = CHARGER_CHARGER_CTRL_REG_CHARGER_ENABLE_Msk |
                          CHARGER_CHARGER_CTRL_REG_CHARGE_START_Msk;

    (void)argc;
    (void)argv;
    if ((CHARGER->CHARGER_CTRL_REG & mask) != mask) {
        console_printf("status = disabled\n");
    } else if (!vbus_ok) {
        console_printf("status = enabled (not connected)\n");
    } else {
        console_printf("status = %s\n", charger_state[state]);
    }
    console_printf("  vbus = %s\n", vbus_ok ? "OK" : "NOK");
    console_printf("  tbat = %s\n", tbat_status[bat_state]);
#if MYNEWT_VAL(SDADC_BATTERY) || MYNEWT_VAL(GPADC_BATTERY)
    adc = (struct adc_dev *)da1469x_open_battery_adc(BATTERY_ADC_DEV_NAME, 1);
    if (adc) {
        adc_read_channel(adc, 0, &bat_val);
        os_dev_close(&adc->ad_dev);
        console_printf("  vbat = %d mV\n", adc_result_mv(adc, 0, bat_val));
    }
#endif

    return 0;
}

static int
da1469x_charger_shell_cmd_clear_irq(int argc, char **argv)
{
    if (argc == 1) {
        CHARGER->CHARGER_STATE_IRQ_CLR_REG = 0xFFFFFFFF;
        CHARGER->CHARGER_ERROR_IRQ_CLR_REG = 0xFFFFFFFF;
    } else if (0 == strcmp(argv[1], "state")) {
        CHARGER->CHARGER_STATE_IRQ_CLR_REG = 0xFFFFFFFF;
    } else if (0 == strcmp(argv[1], "error")) {
        CHARGER->CHARGER_ERROR_IRQ_CLR_REG = 0xFFFFFFFF;
    } else {
        return -1;
    }
    return 0;
}

static int
da1469x_charger_shell_cmd_set_i(int argc, char **argv)
{
    int rc;
    uint32_t val = CHARGER->CHARGER_CURRENT_PARAM_REG;
    uint32_t i_charge;
    uint32_t i_precharge;
    uint32_t i_eoc;

    if (argc > 1) {
        i_charge = (uint32_t)parse_ll_bounds(argv[1], 5, 560, &rc);
        if (rc) {
            console_printf("I_CHARGE should be in range 5-560\n");
            return 0;
        }
        val &= ~CHARGER_CHARGER_CURRENT_PARAM_REG_I_CHARGE_Msk;
        val |= DA1469X_ENCODE_CHG_I(i_charge);
    }
    if (argc > 2) {
        i_precharge = (uint32_t)parse_ll_bounds(argv[2], 1, 56, &rc);
        if (rc) {
            console_printf("I_PRECHARGE should be in range 1-56\n");
            return 0;
        }
        val &= ~CHARGER_CHARGER_CURRENT_PARAM_REG_I_PRECHARGE_Msk;
        val |= DA1469X_ENCODE_PRECHG_I(i_precharge);
    }
    if (argc > 3) {
        i_eoc = (uint32_t)parse_ll_bounds(argv[3], 4, 35, &rc);
        if (rc) {
            console_printf("I_EOC should be in range 4-35\n");
            return 0;
        }
        val &= ~(CHARGER_CHARGER_CURRENT_PARAM_REG_I_END_OF_CHARGE_Msk |
                 CHARGER_CHARGER_CURRENT_PARAM_REG_I_EOC_DOUBLE_RANGE_Msk);
        val |= DA1469X_ENCODE_EOC_I(i_eoc);
    }
    CHARGER->CHARGER_CURRENT_PARAM_REG = val;

    return 0;
}

static int
da1469x_charger_shell_cmd_set_v(int argc, char **argv)
{
    int rc;
    uint32_t val = CHARGER->CHARGER_VOLTAGE_PARAM_REG;
    uint32_t v;

    if (argc > 1 && strcmp("-", argv[1]) != 0) {
        v = (uint32_t)parse_ll_bounds(argv[1], 2800, 4900, &rc);
        if (rc) {
            console_printf("V_CHARGE should be in range 2800-4900\n");
            return 0;
        }
        val &= ~CHARGER_CHARGER_VOLTAGE_PARAM_REG_V_CHARGE_Msk;
        val |= DA1469X_ENCODE_V(v) << CHARGER_CHARGER_VOLTAGE_PARAM_REG_V_CHARGE_Pos;
    }
    if (argc > 2 && strcmp("-", argv[2]) != 0) {
        v = (uint32_t)parse_ll_bounds(argv[2], 2800, 4900, &rc);
        if (rc) {
            console_printf("V_PRECHARGE should be in range 2800-4900\n");
            return 0;
        }
        val &= ~CHARGER_CHARGER_VOLTAGE_PARAM_REG_V_PRECHARGE_Msk;
        val |= DA1469X_ENCODE_V(v) << CHARGER_CHARGER_VOLTAGE_PARAM_REG_V_PRECHARGE_Pos;
    }
    if (argc > 3 && strcmp("-", argv[3]) != 0) {
        v = (uint32_t)parse_ll_bounds(argv[3], 2800, 4900, &rc);
        if (rc) {
            console_printf("V_REPLENISH should be in range 2800-4900\n");
            return 0;
        }
        val &= ~CHARGER_CHARGER_VOLTAGE_PARAM_REG_V_REPLENISH_Msk;
        val |= DA1469X_ENCODE_V(v) << CHARGER_CHARGER_VOLTAGE_PARAM_REG_V_REPLENISH_Pos;
    }
    if (argc > 4 && strcmp("-", argv[4]) != 0) {
        v = (uint32_t)parse_ll_bounds(argv[4], 2800, 4900, &rc);
        if (rc) {
            console_printf("V_OVP should be in range 2800-4900\n");
            return 0;
        }
        val &= ~CHARGER_CHARGER_VOLTAGE_PARAM_REG_V_OVP_Msk;
        val |= DA1469X_ENCODE_V(v) << CHARGER_CHARGER_VOLTAGE_PARAM_REG_V_OVP_Pos;
    }
    CHARGER->CHARGER_VOLTAGE_PARAM_REG = val;

