apache/mynewt-core/hw/drivers/chg_ctrl/da1469x_charger/src/da1469x_charger_shell.c
    return 0;
}

#if MYNEWT_VAL(DA1469X_CHARGER_USE_CHARGE_CONTROL)

int
da1469x_charger_status_changed(struct charge_control *ctrl, void *arg,
                               void *val, charge_control_type_t type)
{
    charge_control_status_t status;
    charge_control_fault_t fault;

    if (type == CHARGE_CONTROL_TYPE_STATUS) {
        status = *(charge_control_status_t *)val;
        switch (status) {
        case CHARGE_CONTROL_STATUS_DISABLED:
            console_printf("charger: charging disabled\n");
            break;
        case CHARGE_CONTROL_STATUS_NO_SOURCE:
            console_printf("charger: not connected\n");
            break;
        case CHARGE_CONTROL_STATUS_CHARGING:
            console_printf("charger: charging\n");
            break;
        case CHARGE_CONTROL_STATUS_CHARGE_COMPLETE:
            console_printf("charger: charge complete\n");
            break;
        case CHARGE_CONTROL_STATUS_SUSPEND:
            console_printf("charger: charge suspended due to temperature\n");
            break;
        case CHARGE_CONTROL_STATUS_FAULT:
            console_printf("charger: fault Vbat to high or charge time exceeded\n");
            break;
        case CHARGE_CONTROL_STATUS_OTHER:
            break;
        }
    } else if (type == CHARGE_CONTROL_TYPE_FAULT) {
        fault = *(charge_control_fault_t *)val;
        switch (fault) {
        case CHARGE_CONTROL_FAULT_OV:
            console_printf("charger: fault overvoltage\n");
            break;
        case CHARGE_CONTROL_FAULT_THERM:
            console_printf("charger: fault over temperature\n");
            break;
        default:
            break;
        }
    }
    return 0;
}

struct charge_control_listener da1469x_listener = {
    .ccl_type = CHARGE_CONTROL_TYPE_STATUS | CHARGE_CONTROL_TYPE_FAULT,
    .ccl_func = da1469x_charger_status_changed,
};

static struct da1469x_charger_dev *charger;

static int
da1469x_charger_shell_cmd_listen(int argc, char **argv)
{
    if (argc > 1) {
        if (strcmp("start", argv[1]) == 0) {
            if (charger == NULL) {
                charger = (struct da1469x_charger_dev *)os_dev_open("charger", 1, NULL);
                if (charger) {
                    charge_control_register_listener(&charger->chg_ctrl, &da1469x_listener);
                }

            }
        } else if (strcmp("stop", argv[1]) == 0) {
            if (charger) {
                charge_control_unregister_listener(&charger->chg_ctrl, &da1469x_listener);
                os_dev_close(&charger->dev);
                charger = NULL;
            }
        }
    }
    return 0;
}

#endif /* MYNEWT_VAL(DA1469X_CHARGER_USE_CHARGE_CONTROL) */

static int
da1469x_charger_reg_cmd(int argc, char **argv, bool reg_read)
{
    const struct reg *reg = NULL;
    uint32_t val;
    int status;
    int i;
    bool decode = da1469x_charger_cli_decode_fields;

    for (i = 0; i < NUM_CHARGER_REGS; ++i) {
        if (strcasecmp(charger_regs[i].name, argv[1]) == 0) {
            reg = charger_regs + i;
        }
    }
    if (!reg) {
        return -1;
    }

    if (reg_read) {
#if MYNEWT_VAL(DA1469X_CHARGER_CLI_DECODE)
        if (strcmp(argv[2], "decode") == 0) {
            decode = true;
        }
#endif
        val = *reg->addr;
        da1469x_charger_dump_register(reg, val, decode);
    } else {
        val = (uint32_t)parse_ull_bounds(argv[2], 0, 0xFFFFFFFF, &status);
        if (status) {
            console_printf("Invalid register value %s\n", argv[2]);
            return 0;
        }
        *reg->addr = val;
    }

    return 0;
}

static int
da1469x_charger_shell_cmd(int argc, char **argv)
{
    if (argc == 1) {
        return da1469x_charger_help();
    }

    argv++;
    argc--;
    if (strcmp(argv[0], "help") == 0) {
        return da1469x_charger_help();
#if MYNEWT_VAL(DA1469X_CHARGER_CLI_DECODE)
    } else if (strcmp(argv[0], "decode") == 0) {
        return da1469x_charger_shell_cmd_decode(argc, argv);
#endif
    } else if (strcmp(argv[0], "dump") == 0) {
        return da1469x_charger_shell_cmd_dump(argc, argv);
    } else if (strcmp(argv[0], "enable") == 0) {
        return da1469x_charger_shell_cmd_enable(argc, argv);
    } else if (strcmp(argv[0], "disable") == 0) {
        return da1469x_charger_shell_cmd_disable(argc, argv);
    } else if (strcmp(argv[0], "status") == 0) {
        return da1469x_charger_shell_cmd_status(argc, argv);
    } else if (strcmp(argv[0], "seti") == 0) {
        return da1469x_charger_shell_cmd_set_i(argc, argv);
    } else if (strcmp(argv[0], "setv") == 0) {
        return da1469x_charger_shell_cmd_set_v(argc, argv);
#if MYNEWT_VAL(DA1469X_CHARGER_USE_CHARGE_CONTROL)
    } else if (strcmp(argv[0], "listen") == 0) {
        return da1469x_charger_shell_cmd_listen(argc, argv);
#endif
    } else if (strcmp(argv[0], "clrirq") == 0) {
        return da1469x_charger_shell_cmd_clear_irq(argc, argv);
    } else if (strcmp(argv[0], "read") == 0) {
        return da1469x_charger_reg_cmd(argc, argv, true);
    } else if (strcmp(argv[0], "write") == 0) {
        return da1469x_charger_reg_cmd(argc, argv, false);
    }

    return da1469x_charger_shell_err_unknown_arg(argv[1]);
}

static const struct shell_cmd da1469x_charger_shell_cmd_struct = {
    .sc_cmd = "charger",
    .sc_cmd_func = da1469x_charger_shell_cmd
};

static const struct shell_cmd da1469x_charger_cmds[] = {
#if MYNEWT_VAL(DA1469X_CHARGER_CLI_DECODE)
    SHELL_CMD("decode", da1469x_charger_shell_cmd_decode, NULL),
#endif
    SHELL_CMD("dump", da1469x_charger_shell_cmd_dump, NULL),
    SHELL_CMD("enable", da1469x_charger_shell_cmd_enable, NULL),
    SHELL_CMD("disable", da1469x_charger_shell_cmd_disable, NULL),
    SHELL_CMD("status", da1469x_charger_shell_cmd_status, NULL),
    SHELL_CMD("clrirq", da1469x_charger_shell_cmd_clear_irq, NULL),
    SHELL_CMD("seti", da1469x_charger_shell_cmd_set_i, NULL),
    SHELL_CMD("setv", da1469x_charger_shell_cmd_set_v, NULL),
#if MYNEWT_VAL(DA1469X_CHARGER_USE_CHARGE_CONTROL)
    SHELL_CMD("listen", da1469x_charger_shell_cmd_listen, NULL),
#endif
    SHELL_CMD(NULL, NULL, NULL)
};

int
da1469x_charger_shell_init(struct da1469x_charger_dev *dev)
{
    int rc;
    (void)dev;

    rc = shell_cmd_register(&da1469x_charger_shell_cmd_struct);
    SYSINIT_PANIC_ASSERT(rc == 0);

    rc = shell_register("charger", da1469x_charger_cmds);
    return rc;
}

#endif
